Revit 2015 API
AnalyticalModelSurface Methods
The AnalyticalModelSurface type exposes the following members.
Methods
Name | Description
Approximate
 Switches between non-approximated (e.g., Curved) Analytical Models and approximated (made up of lines only) Analytical Models
 (Inherited from AnalyticalModel.)
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
CanApproximate
 Indicates if Analytical Model can be approximated or not.
 (Inherited from AnalyticalModel.)
CanBeHidden
Indicates if the element can be hidden in the view.
 (Inherited from Element.)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from Element.)
CanDisableAutoDetect
 Indicates if Analytical Auto-detect can be disabled programmatically
 (Inherited from AnalyticalModel.)
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from Element.)
CanHaveRigidLinks
 Indicates if Analytical Model supports Rigid Links.
 (Inherited from AnalyticalModel.)
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
 (Inherited from Element.)
CanUseHardPoints
 Indicates if Analytical Model can use Hard Points.
 (Inherited from AnalyticalModel.)
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from Element.)
CloneAdjustment
 The method clones the adjustment of one end of the AM on another AM, with respect to the one of the ends. One of the Analytical Model ends
 (Inherited from AnalyticalModel.)
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from Element.)
Disconnect
 Unjoin from Hub Element.
 (Inherited from AnalyticalModel.)
Dispose |  (Inherited from Element.)
Enable
 Enables or disables Analytical Model, if the Element allows a one-operation Analytical Model toggle.
 (Inherited from AnalyticalModel.)
EnableAutoDetect
 Enable or disable Analytical Auto-detect.
 (Inherited from AnalyticalModel.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAlignmentMethod |  Obsolete.
 Gets the alignment method for a given selector and direction.
 (Inherited from AnalyticalModel.)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from Element.)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from Element.)
GetAnalyticalModelSketchComponents
 Retrieves a collection of AnalyticalModelSketchComponent objects, which are useful for those Analytical Models that have finer calibration below the Element level.
 (Inherited from AnalyticalModel.)
GetAnalyticalModelSupports
 Retrieves the AnalyticalModelSupport array, which is useful to extract Analytical Support Information from Elements.
 (Inherited from AnalyticalModel.)
GetAnalyticalProjectionDatumPlane |  Obsolete.
 Gets the datum plane for a given selector and direction.
 (Inherited from AnalyticalModel.)
GetAnalyticalProjectionType |  Obsolete.
 Retrieves Analytical Model projection information for a specific direction. in direction: direction in which the Analytical Model may be projected.
 (Inherited from AnalyticalModel.)
GetAnalyzeAs
 Returns value of Analyze As parameter for Analytical Model.
 (Inherited from AnalyticalModel.)
GetApproximationDeviation
 Retrieves amount by which approximation is made.
 (Inherited from AnalyticalModel.)
GetAutoDetectMatchedElements
 Retrieves other Element Ids that this Element is Auto-detecting against.
 (Inherited from AnalyticalModel.)
GetCurve
 Returns the single curve of the Analytical Model, if it is only one curve.
 (Inherited from AnalyticalModel.)
GetCurves
 Retrieves all curves for the Analytical Model of a given type.
 (Inherited from AnalyticalModel.)
GetElementId
 Retrieves Element Id of the structural element corresponding to the Analytical Model.
 (Inherited from AnalyticalModel.)
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from Element.)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from Element.)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from Element.)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from Element.)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from Element.)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from Element.)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from Element.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetHiddenOpenings
 Retrieves Identifiers of all hidden openings.
GetLocalCoordinateSystem
 Gets the local coordinate system (LCS) for an analytical model element.
 (Inherited from AnalyticalModel.)
GetLoops
 Retrieves Analytical Model Loops with respect to the loopType.
GetManualAdjustmentMatchedElements
 Retrieves other Element Ids against which the Analytical Model has been adjusted.
 (Inherited from AnalyticalModel.)
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from Element.)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from Element.)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from Element.)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from Element.)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from Element.)
GetOffset
 Gets the offset of the analytical model at end.
 (Inherited from AnalyticalModel.)
GetOpeningLoops
 Retrieves Array of CurveLoops of Analytical Surface Opening.. Only valid openings for hide are allowed.
GetOpenings
 Retrieves Analytical Surface Openings Identifiers valid to be used in showOpening/hideOpening functions.
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from Element.)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from Element.)
GetParameters
Retrieves the parameters from the element via the given name.
 (Inherited from Element.)
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from Element.)
GetPlane
 Returns plane on which Analytical Model Surface Element is lying. Only planar surface elements are valid for this function.
GetPoint
 Retrieves point of the Analytical Model.
 (Inherited from AnalyticalModel.)
GetReference
 Returns a reference to a given curve within the analytical model.
 (Inherited from AnalyticalModel.)
GetRigidLink
 Returns rigid link curve corresponding to selector.
 (Inherited from AnalyticalModel.)
GetSweptProfile
 Retrieves the swept profile information for Analytical Model.
 (Inherited from AnalyticalModel.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from Element.)
GetValidTypes()
 Obtains a set of types that are valid for this element.
 (Inherited from Element.)
HasAlignment |  Obsolete.
 Checks if analytical alignment is applicable at a given end.
 (Inherited from AnalyticalModel.)
HasDeletedLinks
 Indicates if Analytical Model contains deleted Analytical Links.
 (Inherited from AnalyticalModel.)
HasOpenings
 Checks if the analytical model surface have any openings.
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from Element.)
HasRigidLinksWith
 Indicates if Analytical Model has Rigid Links with specified element.
 (Inherited from AnalyticalModel.)
HasSweptProfile
 Indicates if this Element's Analytical Model can be represented as a swept profile.
 (Inherited from AnalyticalModel.)
HideOpening
 Hides set of curves originating from Opening.
IsAnalyzeAsValid
 Determines if the given Analyze As parameter is valid for this Element.
 (Inherited from AnalyticalModel.)
IsApproximated
 Indicates if Analytical Model is approximated or not.
 (Inherited from AnalyticalModel.)
IsAutoDetectEnabled
 Reports if Analytical Auto-detect for the given direction is enabled.
 (Inherited from AnalyticalModel.)
IsElementFullySupported
 Indicates if Analytical Model is fully supported.
 (Inherited from AnalyticalModel.)
IsEnabled
 Reports whether the Analytical Model is enabled or disabled.
 (Inherited from AnalyticalModel.)
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from Element.)
IsHidden
Identifies if the element has been permanently hidden in the view.
 (Inherited from Element.)
IsManuallyAdjusted
 Indicates if the Analytical Model has been manually adjusted by the user.
 (Inherited from AnalyticalModel.)
IsModified
 Checks if AM has been adjusted from auto-detect at any end.
 (Inherited from AnalyticalModel.)
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from Element.)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from Element.)
IsOpeningHidden
 Returns true if opening with given Identifier is hidden.
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from Element.)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from Element.)
IsPlanar
 Indicates if the Analytical Model Surface Element is planar.
IsSingleCurve
 Indicates if the Analytical Model can be expressed as a single curve.
 (Inherited from AnalyticalModel.)
IsSinglePoint
 Indicates if the Analytical Model can be expressed as a single point.
 (Inherited from AnalyticalModel.)
IsSurface |  Obsolete.
 Checks if the analytical model belongs to the surface object like floor, slab or wall.
 (Inherited from AnalyticalModel.)
IsValidDirectionForAutoDetect
 Tests if the supplied direction is valid for Analytical Auto-detect.
 (Inherited from AnalyticalModel.)
IsValidDirectionForProjection |  Obsolete.
 Indicates if the input direction is valid for Analytical Model projection.
 (Inherited from AnalyticalModel.)
IsValidForManualAdjustment
 Indicates if the identified reference is acceptable for Manual Analytical Adjustment.
 (Inherited from AnalyticalModel.)
IsValidManualAdjustmentSource
 Indicates if the identified reference is acceptable as a source for Manual Analytical Adjustment.
 (Inherited from AnalyticalModel.)
IsValidManualAdjustmentTarget
 Indicates if reference is acceptable as a "Target" for Manual Analytical Adjustment.
 (Inherited from AnalyticalModel.)
IsValidOpeningForHide
 Returns true if opening with given Identifier could be hidden, false for all other Identifiers.
IsValidProjectionDatumPlane |  Obsolete.
 Indicates if a given Datum Plane is valid for analytical model projection with respect to the given analytical direction.
 (Inherited from AnalyticalModel.)
IsValidProjectionType |  Obsolete.
 Indicates if a given Analytical Projection Type is valid for the given Analytical Element Selector and Analytical Direction.
 (Inherited from AnalyticalModel.)
IsValidRigidLinksOption
 Indicates if Rigid Links option is valid for the Analytical Model.
 (Inherited from AnalyticalModel.)
IsValidSelector
 Indicates if the input selector is valid for the Analytical Model.
 (Inherited from AnalyticalModel.)
IsValidSelectorAndDirection |  Obsolete.
 Indicates if the input selector is valid for analytical direction for Analytical Model.
 (Inherited from AnalyticalModel.)
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from Element.)
LookupParameter
Attempts to find a parameter on the element which has the given name.
 (Inherited from Element.)
ManuallyAdjust
 Perform Manual Analytical Adjustment on analytical model, with respect to another Element
 (Inherited from AnalyticalModel.)
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from Element.)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from Element.)
ResetLinks
 The function is trying to recreate analytical link elements that were deleted by the user.
 (Inherited from AnalyticalModel.)
ResetManualAdjustment
 Resets all manual adjustments performed by the user onto the Analytical Model.
 (Inherited from AnalyticalModel.)
SetAlignmentMethod |  Obsolete.
 Sets the alignment method for a given selector and direction.
 (Inherited from AnalyticalModel.)
SetAnalyticalProjectionDatumPlane |  Obsolete.
 Sets the datum plane for a given selector and direction.
 (Inherited from AnalyticalModel.)
SetAnalyticalProjectionType |  Obsolete.
 Sets the analytical model projection to a preset value.
 (Inherited from AnalyticalModel.)
SetAnalyzeAs
 Sets value of Analyze As parameter for this Element.
 (Inherited from AnalyticalModel.)
SetApproximationDeviation
 Adjusts the amount by which approximation is made.
 (Inherited from AnalyticalModel.)
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from Element.)
SetLoops
 Set new analytical model geometry (newLoops) for analytical surface elements such as floors and slabs.
SetOffset
 Sets the offset of the analytical model at end.
 (Inherited from AnalyticalModel.)
SetUsesHardPoints
 Sets Hard Points for the Analytical Model.
 (Inherited from AnalyticalModel.)
ShowOpening
 Shows previously hidden set of curves originating from Opening.
SupportsManualAdjustment
 Indicates if the Element supports Manual Analytical Adjustment.
 (Inherited from AnalyticalModel.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
UsesHardPoints
 Indicates if the Analytical Model is using Hard Points during approximation.
 (Inherited from AnalyticalModel.)
See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace